# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "mongodb/brew"
tap "oven-sh/bun"

# Core utilities and dependencies
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "bash"
brew "ccache"
brew "cmake"
brew "gmp"
brew "coreutils"
brew "libevent"
brew "libyaml"
brew "llvm"
brew "pkg-config"
brew "libtool"
brew "fzf"
brew "gd"
brew "gdk-pixbuf"
brew "librsvg"
brew "libffi"
brew "libmagic"
brew "libxml2"
brew "oniguruma"
brew "parallel"
brew "qt"
brew "ripgrep"
brew "rsync"
brew "wget"

# Programming languages and related tools
brew "node"
brew "corepack"
brew "crystal"
brew "crystalline"
brew "cython"
brew "deno"
brew "esbuild"
brew "ghc"
brew "ghcup"
brew "go"
brew "golangci-lint"
brew "golines"
brew "inko"
brew "lua-language-server"
brew "luarocks"
brew "nim"
brew "ninja"
brew "node@20"
brew "nuget"
brew "opam"
brew "openjdk"
brew "php"
brew "python@3.10"
brew "python@3.11"
brew "python@3.8"
brew "python@3.9"
brew "ruby"
brew "rust"
brew "rustfmt"
brew "rustup"
brew "swift-format"
brew "swiftformat"
brew "swig"

# Development tools and utilities
brew "biome"
brew "gh"
brew "git-filter-repo"
brew "git-lfs"
brew "graphviz"
brew "helix"
brew "hyperfine"
brew "jq"
brew "neovim"
brew "postgresql@14"
brew "watchexec"

# Multimedia tools
brew "ffmpeg"

# Specialized tools and services
brew "fizz"
brew "mongosh"
brew "qemu"
brew "jandedobbeleer/oh-my-posh/oh-my-posh", link: false
brew "modularml/packages/modular"
brew "mongodb/brew/mongodb-community"
brew "oven-sh/bun/bun"
brew "stripe/stripe-cli/stripe"

# Casks (Applications)
cask "font-fira-code"
cask "google-cloud-sdk"
cask "kitty"
cask "macfuse"
cask "zed"
